class ApplicationController < ActionController::Base
  protect_from_forgery with: :exception
  include SessionsHelper
  def set_countries
    @countries = ["アイスランド", "アイルランド", "アメリカ合衆国", "アメリカ領ヴァージン諸島", "アラブ首長国連邦（UAE）", 
                  "アルゼンチン", "アルバニア", "アンドラ", "イギリス", "イスラエル", "イタリア", "イラク", "インド", 
                  "インドネシア", "ウガンダ", "ウクライナ", "ウルグアイ", "エクアドル", "エジプト", "エストニア", "エスワティニ", 
                  "オランダ", "オーストラリア", "オーストリア", "カタール", "カナダ", "カンボジア", "ガーナ", "キュラソー", 
                  "キルギス", "ギリシャ", "クリスマス島", "クロアチア", "グアテマラ", "グアム", "グリーンランド", "ケニア", 
                  "ココス（キーリング）諸島", "コスタリカ", "コロンビア", "サンアンドレス", "サンピエール島・ミクロン島", 
                  "サンマリノ", "シンガポール", "ジブラルタル", "ジャージー", "スイス", "スウェーデン", "スペイン", "スリランカ", 
                  "スロバキア", "スロベニア", "セネガル", "セルビア", "タイ", "タンザニア", "チェコ共和国", "チュニジア", 
                  "チリ", "デンマーク", "トルコ", "ドイツ", "ドミニカ共和国", "ナイジェリア", "ニュージーランド", "ネパール", 
                  "ノルウェー", "ハンガリー", "バヌアツ", "バミューダ", "バングラデシュ", "パキスタン", "パレスチナ", 
                  "ピトケアン諸島", "フィリピン", "フィンランド", "フェロー諸島", "フォークランド諸島", "フランス", "ブラジル", 
                  "ブルガリア", "プエルトリコ", "ベトナム", "ベラルーシ", "ベルギー", "ペルー", "ボツワナ", "ボリビア", 
                  "ポルトガル", "ポーランド", "マカオ", "マダガスカル", "マデイラ", "マルタ", "マルティニーク", "マレーシア", 
                  "マン島", "ミッドウェー島", "メキシコ", "モナコ", "モンゴル", "モンテネグロ", "ヨルダン", "ラオス", "ラトビア", 
                  "リトアニア", "ルクセンブルク", "ルーマニア", "レソト", "レバノン", "レユニオン島", "ロシア", "中国", 
                  "北マケドニア共和国", "北マリアナ諸島", "南アフリカ", "南極大陸", "台湾", "日本", "米領サモア", "韓国", 
                  "香港", "その他"]
  end

  private
    def admin_user
      unless current_user.admin?
        flash[:danger] = "権限がありません。"
        redirect_to root_url
      end
    end

    def correct_user
      redirect_to root_url unless current_user?(@user)
    end

    def admin_or_correct_user
      redirect_to root_url if (!current_user?(@user) && !current_user.admin?)
    end
end
